ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S16-EVK/LPC55S16_LoRaFUOTA/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t Shield_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_0 (pin 54)  */
    GPIO_PinInit(BOARD_INITPINS_Shield_LED_GPIO, BOARD_INITPINS_Shield_LED_PORT, BOARD_INITPINS_Shield_LED_PIN, &Shield_LED_config);

    gpio_pin_config_t RADIO_DIO4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin 22)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_DIO4_GPIO, BOARD_INITPINS_RADIO_DIO4_PORT, BOARD_INITPINS_RADIO_DIO4_PIN, &RADIO_DIO4_config);

    gpio_pin_config_t gpio0_pin14_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 14)  */
    GPIO_PinInit(GPIO, 0U, 16U, &gpio0_pin14_config);

    gpio_pin_config_t Shield_RTC_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_20 (pin 74)  */
    GPIO_PinInit(BOARD_INITPINS_Shield_RTC_RST_GPIO, BOARD_INITPINS_Shield_RTC_RST_PORT, BOARD_INITPINS_Shield_RTC_RST_PIN, &Shield_RTC_RST_config);

    gpio_pin_config_t gpio0_pin20_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 20)  */
    GPIO_PinInit(GPIO, 0U, 23U, &gpio0_pin20_config);

    gpio_pin_config_t RADIO_NSS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin 59)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_NSS_GPIO, BOARD_INITPINS_RADIO_NSS_PORT, BOARD_INITPINS_RADIO_NSS_PIN, &RADIO_NSS_config);

    gpio_pin_config_t Shield_BTN1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_5 (pin 31)  */
    GPIO_PinInit(BOARD_INITPINS_Shield_BTN1_GPIO, BOARD_INITPINS_Shield_BTN1_PORT, BOARD_INITPINS_Shield_BTN1_PIN, &Shield_BTN1_config);

    gpio_pin_config_t RADIO_DIO5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_9 (pin 10)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_DIO5_GPIO, BOARD_INITPINS_RADIO_DIO5_PORT, BOARD_INITPINS_RADIO_DIO5_PIN, &RADIO_DIO5_config);

    gpio_pin_config_t RADIO_DIO3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin 40)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_DIO3_GPIO, BOARD_INITPINS_RADIO_DIO3_PORT, BOARD_INITPINS_RADIO_DIO3_PIN, &RADIO_DIO3_config);

    gpio_pin_config_t SHELD_FLASH_IO2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_11 (pin 93)  */
    GPIO_PinInit(BOARD_INITPINS_SHELD_FLASH_IO2_GPIO, BOARD_INITPINS_SHELD_FLASH_IO2_PORT, BOARD_INITPINS_SHELD_FLASH_IO2_PIN, &SHELD_FLASH_IO2_config);

    gpio_pin_config_t RADIO_DIO0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_14 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_DIO0_GPIO, BOARD_INITPINS_RADIO_DIO0_PORT, BOARD_INITPINS_RADIO_DIO0_PIN, &RADIO_DIO0_config);

    gpio_pin_config_t RADIO_DIO1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_16 (pin 87)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_DIO1_GPIO, BOARD_INITPINS_RADIO_DIO1_PORT, BOARD_INITPINS_RADIO_DIO1_PIN, &RADIO_DIO1_config);

    gpio_pin_config_t RADIO_RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_RESET_GPIO, BOARD_INITPINS_RADIO_RESET_PORT, BOARD_INITPINS_RADIO_RESET_PIN, &RADIO_RESET_config);

    gpio_pin_config_t Shield_RTC_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_22 (pin 41)  */
    GPIO_PinInit(BOARD_INITPINS_Shield_RTC_INT_GPIO, BOARD_INITPINS_Shield_RTC_INT_PORT, BOARD_INITPINS_Shield_RTC_INT_PIN, &Shield_RTC_INT_config);

    gpio_pin_config_t RADIO_DIO2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_25 (pin 77)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_DIO2_GPIO, BOARD_INITPINS_RADIO_DIO2_PORT, BOARD_INITPINS_RADIO_DIO2_PIN, &RADIO_DIO2_config);

    gpio_pin_config_t Shield_BTN2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_31 (pin 91)  */
    GPIO_PinInit(BOARD_INITPINS_Shield_BTN2_GPIO, BOARD_INITPINS_Shield_BTN2_PORT, BOARD_INITPINS_Shield_BTN2_PIN, &Shield_BTN2_config);

    const uint32_t Shield_LED = (/* Pin is configured as PIO0_0 */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI |
                                 /* Analog switch is open (disabled) */
                                 IOCON_PIO_ASW_DI);
    /* PORT0 PIN0 (coords: 54) is configured as PIO0_0 */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_Shield_LED_PORT, BOARD_INITPINS_Shield_LED_PIN, Shield_LED);

    const uint32_t port0_pin10_config = (/* Pin is configured as SWO */
                                         IOCON_PIO_FUNC6 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI |
                                         /* Analog switch is open (disabled) */
                                         IOCON_PIO_ASW_DI);
    /* PORT0 PIN10 (coords: 21) is configured as SWO */
    IOCON_PinMuxSet(IOCON, 0U, 10U, port0_pin10_config);

    const uint32_t RADIO_DIO4 = (/* Pin is configured as PIO0_15 */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI |
                                 /* Analog switch is open (disabled) */
                                 IOCON_PIO_ASW_DI);
    /* PORT0 PIN15 (coords: 22) is configured as PIO0_15 */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_RADIO_DIO4_PORT, BOARD_INITPINS_RADIO_DIO4_PIN, RADIO_DIO4);

